Markdown

Markdown简介:
Markdown 是一种轻量级标记语言，它允许人们“使用易读易写的纯文本格式编写文档，然后转换成有效的XHTML(或者HTML)文档”。
这个语言的目的是希望大家使用“易于阅读、易于撰写的纯文字格式，并选择性的转换成有效的 XHTML (或是HTML)”。 
其中最重要的设计是可读性，也就是说这个语言应该要能直接在字面上的被阅读，而不用被一些格式化指令标记 (像是 RTF 与 HTML)。

Github Markdown使用语法:
1. 标题
  #：一级标题
  ##：二级标题
  ###：三级标题
  ####：四级标题
  #####：五级标题
  ######：六级标题
2. 文字修饰符
  斜体字：*内容*；_内容_
  粗体字：**内容**；__内容__
3. 列表
  无序列表：- 内容；* 内容
  有序列表：不论内容前的序号是否有序，都会自动排序
4. 任务列表
  - [x] Finish my changes
  - [ ] Push my commits to GitHub
  - [ ] Open a pull request
5. 段落
  段落的前后要有空行，所谓的空行是指没有文字内容。若想在段内强制换行的方式是使用两个以上空格加上回车（引用中换行省略回车）。
6. 区块引用
  > 区块引用
  >> 嵌套引用
7. 链接
  [github](http://github.com)
8. 图片
  ![Image of Yaktocat](https://octodex.github.com/images/yaktocat.png)
9. 代码块
  ```语言
  语言代码
  ```
10. 表格
  |标题 | 内容 | 备注|
  |-----|------|-----|
  |今天 | 很热 | 少穿|
  |昨天 | 下雨 | 打伞|
